package com.sist.main;

/*
 * 	객체 지향 프로그램
 * 		Application. Web Application => 캡슐화, 인터페이스 => 연산자, 제어문, 반복문 => 데이터베이스 연동
 * 
 * 	클래스 구성 : 공통적인 데이터, 기능을 모아서 저장 => 사용
 * 	=> 추상화(사물 단순화) => 구체화
 * 		= 멤버변수
 * 		= 메소드
 * 
 * 	=> 1개의 클래스로 동작하는 것이 아님
 * 		여러 개의 클래스를 연관 관계
 * 		행위자 <=> 처리
 * 		사람		자판기
 * 		사용자,	 웹
 * 		관리자
 * 	
 * 	설계에 필요한 데이터 설계(벤치마킹) => 멤버 변수
 * 	기능(메뉴, 버튼) => 메소드 => 멤버 메소드
 * 	변수 => 초기화 => 생성자
 *
 *	클래스를 메모리에 저장
 *	클래스명 변수명 = new 클래스명()
 *	*** 모든 클래스는 생성자를 가지고 있음
 *
 *	재사용 / 데이터 변질, 손실 / 변경이 쉬움...(객체 지향) => 유지 보수
 *	상속, 포함 / 캡슐화 / 다형성(오버라이딩, 오버로딩)
 *
 *	*** 멤버변수
 *			따로 사용 : 인스턴스 변수
 *			1개 사용 : 정적 변수
 *		=> 데이터베이스(정규화)
 *
 */

public class MainClass2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
	}

}
