/*
 *	비트 연산자
 *		예) int a=10;
 *			a&=2 => a=a&2
 *				1010 => 10
 *				0010 => 2
 *			a|=2 => a=10|2
 *				1010 => 10
 *				0010 => 10
 *			a^=2; => a=10^2
 *				1010 => 10
 *				
 *
 * 		   			   &(×)	   |(+)	    ^(비트가 다르면 1, 같으면 0)
 *			-----------------------------------
 *				0 0		0		0		0
 *			-----------------------------------
 *				0 1     0		1		1
 *			-----------------------------------
 *				1 0     0		1		1
 *			-----------------------------------
 *				1 1     1		1		0
 * 
 */
public class 자바복합대입연산자_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		int a=10;
		a&=2; // a=10&2 => a=2
		System.out.println(a);
		
		a=10;
		a|=2;
		System.out.println(a);
		
		a=10;
		a^=2;
		System.out.println(a);
		
	}

}
